Repository: MechanicalDragon963/Lifetime-of-Stones
Catalog: translations/*/LC_MESSAGES/wesnoth-LoS.po
Languages: ru

source: His wounds are very serious, but I can heal them if you give me enough time.
ru: Его раны серьёзны, но я смогу исцелить их, если вы дадите мне достаточно времени.

source: So the Sultan will not die?
ru: Так Султан не умрёт?

source: It's up to us, mate. Take up the defences in the mountains. Don't let the infidels near the Sultan and the Healer. When our Sultan's wounds heal, he will take command and lead us to victory. During my ten years of service, I have been in such situations many times.
ru: Это зависит от нас, дружище. Займите оборону в горах. Не позволяйте неверным приблизиться к Султану и лекарю. Как только раны Султана затянутся, он вновь примет командование и приведёт нас к победе. За десять лет службы я не раз попадал в подобные передряги.

source: The trolls will kill anyone who tries to harm the Sultan!
ru: Тролли раздавят любого, кто попытается навредить Султану!

source: Hold the defenses until the Sultan is healed
ru: Держите оборону, пока Султан не исцелится

source: Defeat one of the nomad leaders
ru: Сразите одного из вождей кочевников

source: Death of Healer
ru: Смерть лекаря

source: Sha, by the will of the Almighty, I am healed!
ru: Ша, волей Всевышнего, я исцелён!

source: Truly, none can compare to your healers, O Great Sultan! What are your orders?
ru: Воистину, нет равных вашим целителям, О Великий Султан! Каков будет ваш приказ?

source: I know nomads like the back of my hand. To defeat them, all we have to do is undermine their confidence that fortune is on their side. To do so, form a strike force and defeat one of their leaders! Here are my orders.
ru: Я знаю кочевников так же хорошо, как собственные пять пальцев. Чтобы одолеть их, нужно подорвать их уверенность в том, что фортуна на их стороне. Для этого соберите силы в кулак и сразите одного из их лидеров! Вот, каков мой приказ.

source: We have already dealt with one of the nomad leaders, O Great Sultan.
ru: Мы уже расправились с одним из вождей кочевников, О Великий Султан.

source: Sha, in that case, their flashy warriors are already hesitating. Destroy one more chief, and they will all flee!
ru: Ша, в таком случае, их вспыльчивые бойцы уже сомневаются. Сразите ещё одного вождя, и все они побегут!

source: It will be done, O Great Sultan.
ru: Будет исполнено, О Великий Султан.

source: It's too dangerous in the open sand for little friends. Let the humans protect the Sultan. The trolls will kill the leader of the infidels!
ru: На открытых песках слишком опасно для маленьких друзей. Путь люди защищают Султана. Тролли прорвутся и убьют лидера неверных!

source: What do you think of that, O Sultan?
ru: Что вы об этом думаете, О Султан?

source: Indeed, the Almighty put these words into the mouth of a troll. My wounds must have clouded my judgment. If we throw all our forces against the one nomad leader, we'll leave the rear unprotected. We'll do as Grump suggested. But don't leave the trolls without cover. I won't stand for all of them dying in these damn sands.
ru: Воистину, Всевышний вложил в уста тролля эти мудрые слова. Видно, раны затуманили мой рассудок. Если мы бросим все силы против одного вождя, мы оставим тыл уязвимым. Поступим, как Ворчун предложил. Но не оставляй троллей без прикрытия. Я не потерплю, если все они погибнут в этих проклятых песках.

source: Beggar Abdul... What are you without your monsters?
ru: Мерзавец Абдул... Кто ты без своих чудовищ?

source: Shut up, you shaitan scum!
ru: Заткнись, отродье шайтана!

source: Truly, none can match your trolls in valor and strength, O Great Sultan. They have defeated all the nomads!
ru: Воистину, никто не сравнится с троллями в доблести и силе, о Великий Султан. Они разбили кочевников!

source: Sha! Our troll friends saved us.
ru: Ша! Да наши друзья-тролли спасли нас.

source: The trolls remember when the Sultan saved them from the jinn. The trolls pay Sultan back in kind.
ru: Тролли помнят, как Султан спас их от джинна. Тролли платят Султану тем же.

source: Such noble creatures! Almighty witness, today you have immortalized your names in the pantheon of heroes of my realm! When we get back to the palace, we'll have a special feast in your honor.
ru: Что за благородные создания! Всевышний свидетель, сегодня вы увековечили свои имена в пантеоне героев моего царства! По возвращении во дворец я устрою особый пир в вашу честь.

source: Truly, you are the wisest of us all, O Great Sultan!! Your plan has worked, the nomads are fleeing!
ru: Воистину, вы - мудрейший из нас, О Великий Султан! Ваш план сработал, кочевники бегут!

source: Such noble creatures! Almighty witness, today you have immortalized your names in the pantheon of heroes of my realm!
ru: Что за благородные создания! Всевышний свидетель, сегодня вы увековечили свои имена в пантеоне героев моего царства!

source: It is time for us to leave, O Sultan. You said it Yourself, nomads are as fickle as the wind. They may return as suddenly as they fled.
ru: Нам пора уходить, О Султан. Вы сами сказали, кочевники переменчивы, как ветер. Столь же быстро, как убежали, они могут повернуть назад.

source: You're right. When we get back to the palace, we'll have a special feast in honor of our heroes.
ru: Ты прав. По возвращении во дворец я устрою особый пир в честь наших героев.

source: I didn't make it... Cure... Sultan...
ru: Я не смог... исцелить... Султана...

source: Without healer, our Sultan is doomed! We are lost!
ru: Без лекаря наш Султан обречён! Мы пропали!

source: A Sudden Evil
ru: Внезапное Зло

source: Even though more trolls died on this trek than ever before, Grump was happy. The trolls had saved the Sultan by returning an old debt to him. And the souls of the dead brothers now went not to stone, but to heaven, where they are happy.
ru: Пусть в этом походе погибло больше троллей, чем когда-либо, Ворчун счастлив. Тролли спасли Султана и вернулись ему старый долг. А души павших братьев теперь не в камне, а в раю, где они счастливы.

source: When the Sultan returned to the palace, he gave the trolls an incredible feast. A huge table stretched across the whole city. All the humans praised the trolls. All the humans sang songs and danced in honour of the trolls. The trolls felt joyful.
ru: Когда Султан вернулся во дворец, он устроил невиданный пир для троллей. Гигантский стол протянулся через весь город. Все люди прославляли троллей. Все люди пели и танцевали в честь троллей. Троллям было так радостно.

source: After the feast, the trolls returned to their families. The Sultan gave the trolls' wives beautiful new clothes. But that's not the main thing. The main thing was that Grump had a son!
ru: После пира тролли вернулись к своим семьям. Султан подарил жёнам троллей красивые новые наряды. Но это не главное. Главное, что у Ворчуна родился сын!

source: Grump is a father now. Grump named his son Abdul after Sultan. Abdul is a little puny for a troll, but that's okay. Grump will raise him to be a strong warrior, just as Zuug once raised Grump.
ru: Ворчун стал отцом. Ворчун назвал своего сына Абдулом, в честь Султана. Абдул немного худоват для троллей, но это ничего. Ворчун вырастит из него могучего воина, прямо как Жууг когда-то вырастил Ворчуна.

source: Upon learning of the birth of his son, the Sultan threw another feast among the palace servants. Truly, the Sultan is the kindest of humans.
ru: Узнав о рождении сына, Султан устроил ещё одно празднество среди дворцовой прислуги. Воистину, Султан - добрейший из людей.

source: Day after day, the trolls basked in the light of glory. Perhaps that light was too bright. Once in the shadows, the Sultan's old guard, led by his own son, staged a rebellion.
ru: День за днём тролли купались в лучах славы. Возможно, эти лучи были слишком яркими. Оказавшись в тени, старая гвардия Султана, ведомая его собственным сыном, устроила мятеж.

source: Wifes
ru: Жёны

source: Rebels
ru: Мятежники

source: That's where those monsters are hiding! Come here!
ru: Так вот, где прячутся эти монстры! Все сюда!

source: Jaffar
ru: Джаффар

source: Jaffar, the Sultan's son? Why did you come to the home of the trolls with weapons?
ru: Джаффар, сын Султана? Зачем ты вломился в дом троллей с оружием?

source: Father should have kept hiding you in the filthy cellar, you monster. Now he's paying for his sins in hell with his dog Omar! You are the last dirty stain on the body of my realm. And now I will wash it away with blood.
ru: Отцу следовало и дальше держать вас в грязном подвале, чудовища. Теперь же он поплатился за свои грехи, так же, как и его пёс Омар! Вы - последнее грязное пятно на теле моего царства. Я смою его кровью!

source: How can you talk about your own father like that! Shaitan must have taken hold of you. Grump will beat shaitan out of you with a club!
ru: Как ты можешь так говорить о своём отце! Никак шайтан завладел тобой. Ворчун выбьет из тебя шайтана дубиной!

source: Defeat Jaffar
ru: Сразите Джаффара

source: Death of 3 wives ($|dead_wifes|/3)
ru: Смерть 3-ёх жён ($|dead_wifes|/3)

source: Try to take the cave hills in the center of the battlefield to gain a tactical advantage.
ru: Постарайтесь занять холмы в центре поля битвы чтобы заполучить тактическое преимущество.

source: How could you succumb to shaitan, Jaffar?
ru: Как ты мог поддаться шайтану, Джаффар?

source: What do you know about our faith, monster..... It is you who are the spawn of shaitan. Even your existence is offensive, but father has gone further. He has allowed you to insult our home. Our faith. Our women! Father sinned too much for power, and the Almighty punished him by my hand.
ru: Да что ты знаешь о нашей вере, монстр... Ты и есть - отродье шайтана. Само твоё существование оскорбительно, но отец пошёл дальше. Он позволил вам осквернить наш дом, нашу веру, наших женщин! В погоне за властью отец согрешил слишком много, и Всевышний наказал его моей рукой.

source: Jaffar is lying. Humans respect trolls. The only one who has sinned is you!
ru: Джаффар лжёт. Люди рады троллям. Кто согрешил, так это ты!

source: Stupid monster. You don't even know what they're happy about. Ah. I regret I won't see the Almighty punish you and all those who messed with you!
ru: Тупоголовое чудовище. Ты так и не понял, чему они радуются. Ах. Жаль, я не увижу, как Всевышний покарает вас и всех, кто с вами связался!

source: Grump can't believe shaitan has captured the Sultan's son. The trolls must flee to the Sultan's chambers. Grump hopes that Sultan is still alive!
ru: Ворчун не может поверить, что шайтан захватил сына Султана. Тролли должны бежать в палаты Султана. Ворчун надеется, Султан ещё жив!

source: The villains slaughtered the trolls' wives! Now the trolls will be miserable!
ru: Злодеи перерезали жён троллей! Теперь тролли будут несчастны!

source: Ow, those jackal hurt me!
ru: Уф, этот шакал ранил меня!

source: Harming the wives of trolls? Grump will crush you for this, you shaitan scum!
ru: Вредить жёнам троллей? Ворчун раздавит тебя, шайтанское отродье!

source: I will rid our nation of your shame, you troll bedfellow!
ru: Я избавлю наш народ от твоего позора, троллья подстилка!

source: Grump
ru: Ворчун

source: Captain Omar
ru: Капитан Омар

source: Little Abdul
ru: Кроха-Абдул

source: Grump feels stronger than ever! Grump rules the primordial flame! Now the trolls will have an army of fire!
ru: Ворчун чувствует себя сильным, как никогда прежде! Ворчун повелевает первородным огнём! Теперь у троллей будет целая армия из огня!

source: Now you can recruit the Fire Guardians!
ru: Теперь вы можете вербовать Огнестражей!

source: Continue to traverse the world to become a Hero or Shaman.
ru: Продолжить познавать мир чтобы стать Героем или Шаманом.

source: Become a legendary thrower
ru: Стать легендарным метателем

source: legendary throw
ru: легендарный бросок

source: Little Abdul fights bravely. Just like Grump at his age. Little Abdul will grow up to be a great troll.
ru: Кроха-Абдул дерётся храбро. Прямо как Ворчун в его годы. Кроха Абдул вырастет великим троллем.

source: Little Abdul fights bravely. Grump is glad he has a worthy heir.
ru: Кроха Абдул сражается храбро. Ворчун рад, что у него достойный наследник.

source: This hot shiny thing has tremendous power. With its help, $unit.name can approach the fire spirits and become an avatar!
ru: Это горячая блестяшка наделена могучей силой. С её помощью, $unit.name приблизится к духам огня и станет аватаром!

source: Grump... Doesn't want to leave the trolls...
ru: Ворчун... Не хочет оставлять троллей...

source: Oh, woe to the Sultan! It's his turn to fall into eternal sleep!
ru: Ой, горе Султану! Настал его черёд заснуть вечным сном!

source: There is not a more dedicated and talented pomander in the desert than Omar! Woe to the Sultan! Who will lead his army now?
ru: Нигде не сыскать столь талантливого и преданного командира, как Омар! Горе Султану! Кто теперь поведёт его воинов в бой?

source: Father, what, uh... What's going on? Abdul... is petrified... Abdul doesn't want to!
ru: Отец, что... происходит? Абдул... каменеет... Абдул не хочет!

source: No, Grump shouldn't have let his son die!
ru: Нет, Ворчун не должен был позволить его сыну погибнуть!
