Repository: MechanicalDragon963/Lifetime-of-Stones
Catalog: translations/*/LC_MESSAGES/wesnoth-LoS.po
Languages: ru

source: Lifetime of Stones
ru: Жили-были камни

source: LoS
ru: ЖБК

source: After the Second Great War, the life of trolls changed forever. The echoes of the defeat at Durn-Turum have traveled through the centuries and reached even the little troll Grump, who was recently born in the Heat Caves. Grump has no idea what adventures the legacy of gray antiquity will lead him into.
ru: После второй Великой Войны жизнь троллей изменилась навсегда. Эхо поражения при Дарн-Туруме пронеслось через века и достигло даже маленького тролля Ворчуна, который совсем недавно родился в Знойных Пещерах. Грумп и представить себе не может, в какие приключения его заведёт наследие седой древности.

source: (Intermediate level, 11 scenarios)
ru: (Средний уровень, 11 сценариев)

source: Boulder
ru: Булыжник

source: Easy
ru: Лёгкий

source: Whelp
ru: Детёныш

source: Normal
ru: Нормальный

source: Grunt
ru: Здоровяк

source: Hard
ru: Трудный

source: Warrior
ru: Воитель

source: Nightmare
ru: Кошмарный

source: Lead Designer
ru: Ведущий дизайнер

source: Assistance
ru: Поддержка

source: The ritual of growing up
ru: Ритуал взросления

source: Upgrade all trolls to at least level two in <i>The Rolling Stones</i>.
ru: Продвиньте всех троллей хотя бы до второго уровня в <i>Катящихся Камнях</i>.

source: Not such burning Sun
ru: Не такое уж и палящее Солнце

source: Find something to shelter from the Sun in <i>The Realm of Sand</i>.
ru: Найдите, чем прикрыться от Солнца в <i>Царстве Песка</i>.

source: Fried crawlers
ru: Жареные ползучки

source: Get the fiery power in <i>The Realm of Sand</i>.
ru: Заполучите огненную силу в <i>Царстве Песка</i>.

source: My grandfather is Firestone!
ru: Мой дед - Огнекамень!

source: Turn the Troll Shaman into an avatar of fire.
ru: Обратите тролля-шамана в аватар огня.

source: The best defence is offence!
ru: Лучшая защита - это нападение!

source: Kill all enemy leaders in <i>The Oasis of Blood</i>.
ru: Победите, убив всех лидеров противника в <i>Оазисе Крови</i>.

source: Generational continuity
ru: Преемственность поколений

source: Grump's son should become a Troll Hero from one advancement.
ru: Сын Ворчуна должен стать троллем-героем с одного продвижения.

source: And they lived happily ever after...
ru: И жили они долго и счастливо...

source: At least 1 little friend survived to the end of <i>The Great Trek</i>.
ru: Хотя бы 1 маленький друг должен уцелеть к концу <i>Великого Путешествия</i>.

source: Not a boulder, but the Great Stone!
ru: Не булыжник, а Великий Камень!

source: Finish the campaign on Nightmare difficulty level.
ru: Пройдите кампанию на Кошмарном уровне сложности.

source: The Rolling Stones
ru: Катящиеся Камни

source: You should know what father said to Grump today! It turns out that the Heat Caves are not the native of our Rolling Stones tribe. Grandfather brought the trolls here from the hills. And before the hills, the trolls lived in the mountains. And before the mountains, the trolls lived in caves. And before caves, the trolls lived in Durn-Turum. This is troll's true native land.
ru: Вы бы знали, что отец рассказал Ворчуну сегодня! Оказывается, Знойные Пещеры - совсем не родина племени Катящихся Камней. Отец привёл сюда троллей с холмов. А до холмов, тролли жили в горах. А до гор, тролли жили в пещерах. А до пещер, тролли жили в Дарн-Туруме. Вот настоящая родина троллей.

source: It was good in Durn-Turum until the ugly dwarves arrived. They awakened a terrible monster, the False Stone, which spewed fire and ate big trolls alive.
ru: В Дарн-Туруме было хорошо, пока не появились уродливые гномы. Они разбудили ужасное чудовище, Лжекамня, что плевался огнём и пожирал больших троллей заживо.

source: The cunning elves offered the trolls help, but in fact sent them to death, straight into the maw of the False Stone. Then the Great Stone (Grump forgot who it was) sacrificed himself so that the trolls escaped. The Great Stone saved Grump's great-great-grandfather.
ru: Подлые эльфы предложили троллям помощь, но на самом деле, они послали троллей на смерть, прямиком в пасть Лжекамня. Тогда Великий Камень (Ворчун забыл, кто это) пожертвовал собой, чтобы тролли спаслись. Великий Камень спас пра-пра-прадеда Ворчуна.

source: Great-great-grandfather founded the Rolling Stones tribe. To escape ugly dwarves and cunning elves, the Rolling Stones never stay in one place for long. Each new leader must lead the trolls to a new habitat. That is how Grump's ancestors led the tribe from distant Durn-Turum to the Heat Caves.
ru: Пра-пра-прадед основал племя Катящихся Камней. Чтобы спастись от уродливых гномов и подлых эльфов, Катящиеся Камни нигде не задерживаются надолго. Каждый новый вождь должен отвести троллей на новое место. Вот так предки Ворчуна и привели племя из далёкого Дарн-Турум в Знойные Пещеры.

source: Father says it is time for the Rolling Stones to roll again.
ru: Отец говорит, Катящимся Камням пора катиться вновь.

source: Rolling Stones
ru: Катящиеся Камни

source: Zuug
ru: Жууг

source: Monsters
ru: Монстры

source: It's time, little ones. The stones say the trolls must find a new home. The stones will show the way. Zuug will lead you.
ru: Время пришло, малыши. Камни говорят, тролли должны найти новый дом. Камни укажут путь, Жууг выведет вас.

source: As Zuug's son, Grump must be first among the cubs. Be brave and stand up for your kin.
ru: Как сын Жууга, Ворчун должен быть первым среди детёнышей. Будь храбр и защищай сородичей.

source: Yes, father.
ru: Да, отец.

source: Follow Zuug to the exit of the cave
ru: Следуйте за Жуугом к выходу из пещеры

source: Bonus Objective:
ru: Бонусное задание:

source: Level up Grump
ru: Продвиньте Ворчуна на уровень 2

source: Death of Zuug
ru: Смерть Жууга

source: Death of Grump
ru: Смерть Ворчуна

source: Zuug can break some cave walls with his hammer. Allow him to stand on a hex with a rubble to break the deadlock.
ru: Жууг может ломать некоторые стены пещеры своим молотом. Позвольте ему встать на гекс с завалом, чтобы пробить тупик.

source: The stones say the trolls should head east.
ru: Камни говорят, троллям на восток.

source: The stones say the exit is near. The trolls should head north.
ru: Камни говорят, выход близко. Троллям нужно на север.

source: There is the exit. Zuug did not realize breaking through the cave walls would be so hard. The stones say Zuug's time is running out. The stones are calling Zuug.
ru: Вот и выход. Не думал Жууг, что пробиваться сквозь стены будет так трудно. Камни говорят, пробил час Жууга. Камни зовут Жууга к себе.

source: What are father saying? Father so big and strong. Father just need to rest.
ru: Что говорит отец? Отец такой большой и сильный. Отцу просто нужен отдых.

source: Listen. Grump gonna lead the tribe. Finish what father started. Find the trolls a new home. Be solid as a rock. Beware of cunning elves and ugly dwarves. Do not forget the legend father told. Pass it on to the young trolls. Learn to listen to the stones. Never go back.
ru: Послушай. Ворчун должен возглавить племя. Закончи, что отец начал. Найди троллям новый дом. будь твёрд, как скала. Остерегайся уродливых гномов и подлых эльфов. Не забывай легенду, что отец рассказал. Пересказывай её молодым троллям. Учись слушать камни. Никогда не поворачивай назад.

source: Father, no, do not leave trolls...
ru: Отец, нет, не оставляй троллей...

source: Grump can not believe it. Not so long ago, father seemed so strong and healthy... Grump will do what father told. What these stones say... Grump guess they say the trolls should head north. Follow Grump.
ru: Ворчун не может в это поверить. Ещё совсем недавно отец выглядел таким сильным и здоровым... Ворчун поступит, как отец велел. Что там говорят эти камни... Ворчун думает, они говорят, что троллям на север. Следуйте за Ворчуном.

source: Grump is fighting good. Seems that he has raised a worthy troll. With Grump the Rolling Stones will be fine.
ru: Ворчун дерётся хорошо. Похоже он вырос в достойного троллям. С Ворчуном Катящиеся Камни будут в порядке.

source: The Great Trek
ru: Великое Путешествие

source: The trolls found the Sultan lying in his chambers with his throat slit. The trolls were too late.
ru: Тролли нашли Султана валяющимся в своих палатах с перерезанным горлом. Тролли опоздали.

source: Grump did not understand: Sultan was so faithful, how did shaitan get to him? How had the Almighty allowed this to happen? Grump also did not understand what to do now.
ru: Ворчун не может взять в толк: Султан был таким правоверным, как шайтан добрался до него? Как Всевышний допустил это? Ещё Ворчун не может взять толк, что теперь делать.

source: His wife gave Grump a way out. Grump must become the new Sultan. Grump was hesitant, but the other troll wives supported him. They said they had learned how to rule the kingdom from Wazir and would always give good advice.
ru: Жена подсказала Ворчуну выход. Ворчун должен стать новым Султаном. Ворчун сомневался, но другие жёны троллей тоже поддержали его. Они говорили, что научились управлять царством у Вазира, и всегда готовы дать дельный совет.

source: Grump had his doubts, for the Vazir was not ruling the kingdom correctly. But at the same time Grump realized that only he could continue the Sultan's work. Only trolls are as hard as stone, so that they cannot succumb to shaitan's influence.
ru: Ворчун колебался, ведь Вазир правил своими людьми плохо. В то же время Ворчун осознал, что только он может продолжить дело Султана. Только тролли тверды, как камень, и не поддаются влиянию шайтана.

source: Grump has become the new Sultan. To Grump's surprise, the humans welcomed him gladly. Indeed, the Almighty unites all creatures. Oh, Grump spoke like a Sultan...
ru: Так Ворчун стал новым Султаном. К его удивлению, люди приняли его радушно. Воистину, Всевышний объединяет всех созданий. Ой, Ворчун заговорил как Султан...

source: Grump did not realize how hard it was for the Sultan to rule the realm. Good thing the Sultan had Grump. But Grump had no one. Grump felt that shaitan had almost found the trolls. Every year more and more of his henchmen attacked Grump's realm. Every year more misfortunes happened.
ru: Ворчун даже не догадывался, как сложно было Султану управлять царством. Хорошо, что у Султана был Ворчун. Но у Ворчуна никого не было. Ворчун чувствовал, что шайтан почти нашёл троллей. С каждым годом всё больше и больше его приспешников нападали на царство Ворчуна. С каждым годом случалось всё больше несчастий.

source: When Grump sensed that shaitan was getting very close, he made the only right decision.
ru: Когда Ворчун почувствовал, что шайтан уже очень близко, он принял единственное правильное решение.

source: Dunefolk
ru: Народ Пустыни

source: Our realm has been invaded by infidels... Even now I can see the smoke from our capital on the horizon..... O Great Troll Sultan, why do you lead us not into battle but into the desert?
ru: Наше царство захвачено неверными... Даже сейчас я вижу, как дым от нашей столицы поднимается из-за горизонта... О Великий Тролль-Султан, почему ты ведёшь нас не в бой, но в пустыню?

source: Though shaitan has captured our realm, do not despair, little friends. The Almighty showed Grump the way. Grump will lead everyone to a new better home where shaitan will not find us. Follow Grump!
ru: Пусть шайтан захватил наше царство, не отчаивайтесь, маленькие друзья. Всевышний указал Ворчуну путь. Ворчун приведёт всех в новый лучший дом, где шайтан не найдёт нас. Все за Ворчуном!

source: If so, lead us to a new heaven, O Great Troll Sultan, blessed by the skies!
ru: Раз так, веди нас в рай, о Великий Тролль-Султан, благословлённый небом!

source: Move Grump to the east border of the map
ru: Ворчун должен достигнуть восточной границы карты

source: Death of Little Abdul
ru: Смерть Крохи-Абдула

source: Your allies from the dunefolk will try to follow the trolls and stick as a group.
ru: Ваши союзники из народа пустыни будут стараться следовать за троллями и держаться группой.

source: You don't have to worry too much about the survival of your allies. It is better to gather the trolls into one group and move forward.
ru: Не стоит слишком сильно переживать о выживании союзников. Лучше держите троллей одной группой и продвигайтесь вперёд.

source: The Almighty has guided us to the mountains. That's good. The voice of the Almighty is clearer through the rocks.
ru: Всевышний привёл нас в горы. Это хорошо. Через камни голос Всевышнего доносится яснее.

source: Indeed, the ways of the Almighty are inscrutable, for these mountains are known only for impassable rubble and terrible monsters.
ru: Воистину, пути Всевышнего неисповедимы, ибо эти горы славятся лишь непроходимыми завалами и ужасными чудовищами.

source: Sultan Abdul said that the Almighty does not send trials greater than we can bear. Do not be afraid, little friends. The trolls will clear your path.
ru: Султан Абдул говорил, что Всевышний не посылает испытаний больше, чем мы можем вынести. Не отчаивайтесь, маленькие друзья. Тролли расчистят путь.

source: Aimighty says, our home is in these caves. Praise the Almighty! Grump really missed the caves.
ru: Всевышний говорит, наш дом в этих пещерах. Слава Всевышнему! Ворчун соскучился по пещерам.

source: Almighty... The voice of the Almighty fades in the caves. No wonder, He lives in the sky. But the stones say that the trolls are near.
ru: Всевышний... Голос Всевышнего глохнет в пещерах. Оно и понятно, Он ведь живёт на небе. Но камни говорят, что тролли уже близко.

source: Grump, our path is hard. Crawlers are killing our little friends.
ru: Ворчун, наш путь труден. Ползучки убивают наших маленьких друзей.

source: There's no need to be afraid of crawlers, fighting them makes us grow. Grump is sure the little friends will grow too.
ru: Не стоит бояться ползучек, сражаясь с ними, мы выросли. Ворчун уверен, маленькие друзья тоже вырастут.

source: Crawlers killed all the little friends...
ru: Ползучки перебили всех маленьких друзей...

source: What happened? I know crawlers are so weak. Even a troll whelp could crush dozens of them.
ru: Как так вышло? Ведь ползучки такие слабые. Даже маленький тролль может раздавить с десяток их.

source: It seems the little friends were much weaker than the trolls.
ru: Похоже, маленькие друзья были гораздо слабее троллей.

source: Uh-huh. At least they already found their home in the heaven. Now we just need to find a home for the trolls. Not in the heaven, but in the caves.
ru: Угу-м. Зато они уже нашли свой дом в раю. Нам осталось лишь найти дом для троллей. Не в раю, а где-нибудь в пещерах.

source: The little friends grow up fighting crawlers, just like trolls. At the end of the journey, they all will become mighty warriors!
ru: Маленькие друзья растут, сражаясь с ползучками, прямо как тролли. К концу путешествия они все станут могучими воинами!

source: Epilogue
ru: Эпилог

source: Many years later...
ru: Много лет спустя...

source: Like his father years ago, Grump told the whelps the legend of the Rolling Stones tribe, beginning with Durn-Turum and and ending with the events of his life.
ru: Прямо как отец много лет назад, Ворчун рассказал детёнышам легенду о Катящихся Камнях, начиная от Дарн-Турума и заканчивая приключениями из его собственной жизни.

source: ...That's how the Rolling Stones arrived in this cave. It was good here, but Grump feels the time has come. The Rolling Stones must find a new home, lest shaitan find the Rolling Stones. Grump will lead you out.
ru: ...Вот так Катящиеся Камни оказались в этой пещере. Тут было хорошо, но Ворчун чувствует, что время пришло. Катящиеся Камни должны найти новый дом, иначе шайтан найдёт Катящихся Камней. Ворчун выведет вас.

source: As Grump's eldest son, Abdul must be first among the trolls. Be brave and protect your kin.
ru: Как старший сын Ворчуна, Абдул должен быть первым среди троллей. Будь храбр и защищай сородичей.

source: The Realm of Sand
ru: Царство Песка

source: Grump, the trolls been walking on sand for days. It is hot and there is nothing to eat. There is nothing to drink. Are Grump sure the rocks pointed this way?
ru: Ворчун, тролли идут по песку целыми днями. Тут жарко и нечего есть. Тут нечего пить. Ворчун уверен, что камни указали именно этот путь?

source: Do not despair. Father said the trolls should be solid as a rock, remember? The stones guided the trolls here. Grump sure, the sand will run out soon.
ru: Не отчаивайся. Отец велел троллям быть твёрдыми, как скала, помнишь? Камни направили троллей сюда. Ворчун уверен, песок скоро кончится.

source: Move north
ru: Двигайтесь на север

source: Explore the area along the way, but don't spread out too much to avoid becoming easy prey for desert monsters.
ru: Исследуйте местность вокруг, но не разбредайтесь слишком далеко, чтобы не стать лёгкой добычей для пустынных монстров.

source: Look, a crawler! Now the trolls going to have a meal.
ru: Гляди, ползучка! Сейчас у троллей будет перекус.

source: The crawlers here are stale and not tasty at all, but it is better than nothing. Now the trolls need to find something to drink them with.
ru: Ползучки здесь сухие и совсем не вкусные, но это лучше чем ничего. Теперь троллям нужно найти, чем её запить.

source: Look, it is water!
ru: Вон там, вода!

source: See, the stones were right, it is not so bad in the sand. Come on, let's go for a swim!
ru: Видишь, камни были правы, в песке не так уж и плохо. Айда искупаемся!

source: Move Grump to the water
ru: Переместите Ворчуна в воду

source: Grump did not realize it could be so good in the water!
ru: Ворчун и не думал, что в воде может быть так хорошо!

source: Sibjan
ru: Сибджан

source: Foolish creatures, how easily you fell into my trap! The desert creatures will ravage your bodies, and I will devour your souls!
ru: Глупые создания, как легко вы попались в мою ловушку! Пустынные твари разорвут ваши тела, и я пожру ваши души!

source: The trolls are trapped! Grump, what do the trolls do?!
ru: Тролли в ловушке! Ворчун, что делать?!

source: Let's give that brat a good beating! He will know how to trick trolls!
ru: Зададим этому негодю хорошую трёпку! Будет знать, как обманывать троллей!

source: Defeat the Jinn
ru: Одолейте джинна

source: Scuttler scorpions will be difficult to deal with in open sand. It is better to take up defenses on the dunes.
ru: Скорпионы-отшельники - опасные противники на открытых песках. Лучше займите оборону на дюнах.

source: Those nasty crawlers do not want to squash! $second_unit.name worried.
ru: Эти гадкие ползучки совсем не хотят давиться! $second_unit.name переживает.

source: Sha, the stars were right! Something bad is happening on this road. I'm destined for battle.
ru: Ша, звёзды были правы! Нечто плохое происходит на этой дороге. Мне суждена битва.

source: It seems one of the escaped jinns has gone on a rampage, O Great Sultan.
ru: Похоже, один из сбежавших джиннов разбушевался, о Великий Султан.

source: I see. Aren't my subjects in the trap of this shaitan?
ru: Я вижу. Уж не мои ли подданные в ловушке этого шайтана?

source: Fortunately not, O Great Sultan. Some strange creatures are fighting him.
ru: К счастью - нет, о Великий Султан. Какие-то чужеземные создания сражаются с ним.

source: Thank the Almighty, I have enough servants at hand to help them.
ru: Слава Всевышнему, у меня под рукой достаточно слуг, чтобы помочь им.

source: Forgive my impertinence, O Great Sultan, but wouldn't it be better to let the monsters destroy each other and save the lives of our warriors?
ru: Простите мою дерзость, о Великий Султан, но не лучше ли будет позволить чудовищам перебить друг друга и сохранить жизни наших воинов?

source: The Stars are guiding me. I command you to help these creatures destroy the jinn!
ru: Меня ведут Звёзды. Повелеваю вам помочь этим созданиям уничтожить джинна!

source: Truly, you are the kindest of us all, Great Sultan. Your will be done.
ru: Истинно, вы добрейший из нас, о Великий Султан. Ваша воля будет исполнена.

source: Sultan Abdul! Did you come to see how your wishes changed the desert, ha-ha-ha!
ru: Султан Абдул! Пришёл посмотреть, как твои желания изменили пустыню, ха-ха-ха!

source: Tiny creatures run here with weapons. Grump hopes they will help the trolls.
ru: Маленькие создания бегут сюда с оружием. Ворчун надеется, они помогут троллям.

source: Death of Sultan
ru: Смерть Султана

source: Death of Omar
ru: Смерть Омара

source: If it's not me, my brothers will finish what you started, Sultan. Your wishes will destroy you, mark my words!
ru: Не я, так мои братья закончат то, что ты начал, Султан. Твои желания уничтожат тебя, попомни мои слова!

source: The jinn is defeated, O Great Sultan.
ru: Джинн повержен, о Великий Султан.

source: Your people never cease to delight me, Omar. Well done. Now I wish to meet the strangers we've rescued.
ru: Твои люди не перестают меня радовать, Омар. Хорошая работа. Теперь я желаю познакомиться с чужаками, что мы спасли.

source: Truly, the Almighty never ceases to amaze. I have seen many things in my life, but this is the first time I have seen such creatures. Who are you? How did you come to my realm?
ru: Воистину, Всевышний не перестаёт удивлять. За свои лета я повидал многое, но таких созданий вижу впервые. Кто вы такие? Как попали в моё царство?

source: We are the trolls of the Rolling Stones tribe. We're looking for a new home. The stones led us here. And who are you?
ru: Мы - тролли из племени Катящихся Камней. Мы ищем новый дом. Камни направили нас сюда. А ты кто?

source: I am Sultan Abdul, lord of this desert. Everything you see belongs to me. If a friend enters my realm, he will have no need of anything. If an enemy comes here, he will find his death, just like this jinn. Are you trolls friends or enemies?
ru: Я - Султан Абдул, владыка этой пустыни. Всё, что вы видите вокруг, принадлежит мне. Если друг войдёт в моё царство, он не будет испытывать нужды ни в чём; если же враг явится сюда, он встретит свою смерть, прямо как этот джинн. А вы, тролли, друзья или враги?

source: The trolls need food, water, and a home. The trolls want to be Sultan's friends.
ru: Тролли нуждаются в еде, воде и доме. Тролли хотят быть друзьями Султана.

source: Truly, there is no equal to my stargazers, for their predictions come true exactly! For besides the battle, I was also foretold an amazing encounter. The Stars tied the threads of our destinies together, trolls. We will be friends. Follow me - I will take you to my palace, where I will welcome you as friends with all the Sultan's hospitality!
ru: Воистину, нет равных моим звездочётам, ибо их предсказания сбываются в точности! Ведь кроме битвы мне была предначертана удивительная встреча. Звёзды сплели нити наших судеб воедино, тролли. Мы будем друзьями. Следуйте за мной, я отведу вас в свой дворец, где приму как друзей со всем султанским гостеприимством!

source: Stupid Sultan! You yourself wished your desert to be full of game, so why do you attack the animals?
ru: Глупый Султан! Ты сам желал, чтобы твоя пустыня была полна дичи, так зачем ты нападаешь на зверей?

source: There is no food or water in this abandoned house. Just a piece of cloth. Cover my head from the sun with it.
ru: В заброшенном доме нет ни еды, ни воды. Только кусок ткани. Прикрою им голову от солнца.

source: Cloak of Desert Wanderer
ru: Плащ пустынного странника

source: This cloak protects from the sun and allows the wearer to move faster (+1 movement).
ru: Защищает от солнца и позволяет двигаться быстрее (+1 ход).

source: What an unusual crawler, wanted to hide in the sand! $unit.name wonder what it tastes like?
ru: Что за необычная ползучка, хотела спрятаться в песке! $unit.name хочет попробовать её на вкус.
