Repository: MechanicalDragon963/Lifetime-of-Stones
Catalog: translations/*/LC_MESSAGES/wesnoth-LoS.po
Languages: ru

source: This is a very tasty crawler. And it had some shiny thing on its nose. $second_unit.name gonna take the shiny thing for himself. Ouch, it burns.
ru: Очень вкусная ползучка. А ещё у неё какая-то блестяшка на носу. $second_unit.name возьмёт блестяшку себе. Ай, жжётся.

source: The Ring of Ifrit
ru: Кольцо ифрита

source: An ever-hot ring accidentally lost by a mystical creature. Fortunately, the troll's skin is thick enough to hold it. (Changes the damage type of all attacks to fire).
ru: Раскалённое кольцо, по неведомым обстоятельствам потерянное мифическим существом. К счастью, кожа тролля достаточно толстая, чтобы держать его. (Изменяет тип урона всех атак на огонь).

source: This hot shiny thing has tremendous power. With its help, $second_unit.name can approach the fire spirits and become an avatar!
ru: В этой блестяшке сокрыта могучая сила. С ней $second_unit.name сможет приблизиться к духам огня и стать аватаром!

source: A New Home
ru: Новый Дом

source: Grump never imagined that the stones would lead the trolls to Sultan Abdul.
ru: Ворчун и представить себе не мог, что камни приведут троллей к этому Султану Абдулу.

source: He is very curious. He was asking Grump about the trolls the whole way. How the trolls live, what they do. Sultan was especially interested in how the trolls fight. Grump proudly told Sultan how he had crushed dozens of crawlers in his home cave. Sultan kept shouting unclear phrases, but he seemed to enjoy it.
ru: Он очень любопытный. Всю дорогу спрашивал Ворчуна про троллей. Как тролли живут, что делают. Султан особенно интересовался, как тролли дерутся. Ворчун с гордостью рассказал Султану, как крушил десятки ползучек в родной пещере. Султан всё отвечал непонятными фразами, но похоже, ему это понравилось.

source: The main thing is that Sultan is kind and honest. He fed the trolls with meat and ice-cold water in the palace. The trolls had never eaten so good in their lives.
ru: Главное, что Султан добрый и честный. Он накормил троллей мясом и напоил ледяной водой в своём дворце. За всю жизнь тролли никогда не ели так вкусно.

source: After the feast, the Sultan took the trolls to their new home.
ru: После пиршества, Султан повёл троллей в их новый дом.

source: Trolls
ru: Тролли

source: My humble cellar doesn't compare to a cave, but it's the best I can offer for creatures like you. Do you like it?
ru: Мой скромный подвал не сравнится с пещерой, но это лучшее, что я могу предложить для таких существ, как вы. Вам нравится?

source: It is not a bad place.
ru: Неплохое место.

source: Sha, great! Make yourselves comfortable. My commanding officer will visit you shortly. He will teach you how to fight in the desert.
ru: Ша, великолепно! Располагайтесь, чувствуйте себя как дома. Мой офицер скоро посетит вас, он обучит вас искусству боя в пустыне.

source: The trolls are grateful to the Sultan for everything.
ru: Тролли благодарны Султану за всё.

source: So this is the home the stones directed us to? It is too light, too dry, and no mushrooms.
ru: Так это и есть дом, к которому камни вели нас? Здесь слишком светло, слишком сухо, да и грибов нет.

source: Chin up! The Sultan spoke the truth - the trolls do not need anything anymore. The Sultan fed and gave to drink us. He is our friend. Better to be with the Sultan than in the desert.
ru: Выше нос! Султан не обманул - тролли теперь ни в чём не нуждаются. Султан накормил и напоил нас. Он - наш друг. Лучше быть с Султаном, чем одним в пустыне.

source: You are right, but what do the stones say?
ru: Ты прав, но что говорят камни?

source: These stones do not speak. They are dead. Hmm. The trolls need to get some live rocks in here.
ru: Эти камни не говорят. Они мёртвые. Хм. Троллям нужно принести сюда парочку живых камней.

source: Greetings, trolls! Did you enjoy the Sultan's hospitality?
ru: Приветствую вас, тролли! Ну как, нравится вам гостеприимство Султана?

source: Yes.
ru: Да.

source: Our Sultan is the kindest and fairest of rulers, Almighty bless him. But he has a lot of jealous enemies. So for every day to be carefree like this, we must know how to fight. You're not comfortable fighting in the sand, are you? I'll teach you how to move properly. Form a line!
ru: Наш Султан - добрейший и справедливейший из правителей, благословлённый Всевышним. Но у него есть немало завистливых врагов. Чтобы каждый день был таким же беззаботным, как этот, мы должны уметь сражаться. Я заметил, вам непривычно драться на песке, не так ли? Не беда. Я научу вас правильно двигаться. Встаньте в ряд!

source: From then on, every day the captain trained the trolls from sunrise to sunset. The trolls didn't mind - they had no business in the Sultan's realm, and the rest of the time they ate their fill and rested in their lair. The trolls understood that this happy life had to be protected, and practiced hard. After a while they learned to fight on the sand almost as skillfully as the dunefolk. Now your units move across the sand as easily as they do across the plain!
ru: С тех пор каждый день офицер тренировал троллей от заката до рассвете. Тролли не возражали - у них не было никаких дел в царстве Султана, и остаток времени они проводили, наедаясь досыта и отдыхая в своём логове. Тролли понимали, что эту счастливую жизнь нужно защищать, и упражнялись с усердием. Спустя какое-то время они научились передвигаться по песку почти так же искусно, как народ пустыни! Теперь ваши бойцы передвигаются по песку так же легко, как по равнине!

source: Deceitful Wishes
ru: Коварные Желания

source: When the trolls learned how to fight in the desert, the Sultan Abdul called them to campaign against the jinns. The trolls had already fought one of them. If those jinns are as mean and evil, it is dangerous for the Sultan to go alone. The trolls must help the Sultan.
ru: Когда тролли научились драться в пустыне, Султан Абдул позвал их в поход против джиннов. Тролли уже сражались с одним из них. Если новые джинны такие же злые и коварные, как тот, то Султану опасно идти одному. Тролли должны помочь Султану.

source: Sultan Abdul
ru: Султан Абдул

source: Sabbar
ru: Саббар

source: Jinns
ru: Джинны

source: Gaffaf
ru: Джаффаф

source: Sha, take a look at these ruins! This was once a thriving city. Cursed jinns destroyed it with sandstorms and flooded it with hideous beasts!
ru: Ша, взгляните на эти руины! Когда-то это был процветающий город. Проклятые джинны разрушили его песчаными бурями и заполонили отвратительными монстрами!

source: You foolish Sultan! You yourself wished there were no rebellious cities left in your realm.
ru: Жалкий Султан! Ведь ты сам хотел, чтобы в твоём царстве не было мятежных городов.

source: Despicable Sultan! You yourself wished your subjects to serve you forever.
ru: Подлый Султан! Ведь ты сам хотел, чтобы твои подданные служили тебе вечно.

source: Such nasty creatures. What are they talking about?
ru: Какие гадкие создания. О чём они вообще говорят?

source: Sha! Shaitan speaks from their mouths, why listen to these speeches? Let's defeat the demons in the name of the Almighty!
ru: Ша! Шайтан говорит их устами, к чему слушать эти речи? Уничтожим же демонов во имя Всевышнего!

source: Defeat the Jinns
ru: Победите Джиннов

source: Trolls will not be easy to deal with mud monsters. Try to leave free villages for the Sultan so he can recruit more units.
ru: Троллям будет нелегко справиться с грязевиками. Постарайтесь оставить свободные деревни для Султана, чтобы он мог вербовать больше бойцов.

source: Damn you, sneaky Sultan, let sand consume you!
ru: Будь проклят, подлый Султан, песок да поглотит тебя!

source: A curse from the mouth of a dying jinn is like an insect under my boot. Be gone!
ru: Проклятье из уст умирающего джинна - всё равно что букашка под моим сапогом. Изыди!

source: You wanted to rule forever, you lying Sultan, so why do you run from immortality?
ru: Ты же хотел править вечно, лживый Султан, так почему ты бежишь от бессмертия?

source: Be gone!
ru: Изыди!

source: Finally, we won. Fighting jinns is not easy. Grump is worried that many trolls might die.
ru: Наконец-то, победа. Драться с джиннами нелегко. Ворчун переживает, что многие тролли могли погибнуть.

source: I understand you, for my heart shrinks with pain when my brave warriors die. But it is a necessary price to pay for our prosperity. We must be willing to sacrifice ourselves to prevent villains like these jinns from turning our home into ruins.
ru: Я понимаю тебя, ибо моё сердце сжимается от боли за каждого павшего воителя. Но такова плата за наше процветание. Мы должны быть самоотверженными, чтобы не дать злодеям как эти джинны обратить наш дом в руины.

source: If the jinn destroy the Sultan's palace, the trolls will lose their home again. That's not good. The Sultan is right. The big trolls must fight well for the tribe to live peacefully.
ru: Если бы джинны разрушили дворец Султана, тролли бы снова потеряли дом. Нехорошо. Султан прав. Большие тролли должны драться хорошо, чтобы племя жило в мире.

source: Sha! Wise words. I know how to care not only for the living trolls, but also for the fallen. We'll talk about it at the palace. First of all, you all deserve a good rest.
ru: Ша! Мудрые слов. И, кажется, я знаю как помочь не только живым, но и павшим троллям. Поговорим об этом во дворце. Прежде всего, вы все заслужили хороший отдых.

source: The New Faith
ru: Новая Вера

source: It was a glorious feast, wasn't it, friends... Sha, what's that pile of rocks in the middle of the cellar?
ru: Славный выдался пир, не так ли, друзья... Ша, что это за груда камней посреди подвала?

source: The trolls brought living stones and made a monument to honor their fallen brothers.
ru: Тролли принесли живые камни и сделали обелиск в честь павших братьев.

source: Sha! How does it help your fallen brothers?
ru: Ша! И как это поможет вашим павшим братьям?

source: The fallen trolls are going back to the stone. My father said trolls can talk to them through the boulders.
ru: Павшие тролли возвращаются в камень. Отец говорил, тролли могут говорить с ними через булыжники.

source: O Almighty! What beliefs! So what, you can talk to them?
ru: О Всевышний! Какие заблуждения! И что же, вы можете говорить с ними?

source: Not so much. Fallen trolls don not like to speak.
ru: Не то что бы. Павшие тролли не любят говорить.

source: And are they happy in stone?
ru: А счастливы ли они в камне?

source: Grump does not know.
ru: Ворчун не знает.

source: Sha! My warriors go to heaven after death, where they have plenty of food, water and entertainment, where they live happily until the end of times.
ru: Ша! А мои воины после смерти отправляются в рай, где у них полным-полно пищи, воды и развлечений, где они живут счастливо до конца времён.

source: Grump would like the same for fallen trolls.
ru: Ворчун хотел бы того же для павших троллей.

source: It's easily arranged. All that is needed is to accept the true faith, our Almighty.
ru: Это легко устроить. Вам нужно лишь принять истинную веру, нашего Всевышнего.

source: The Sultan often mentions the Almighty. Who is he?
ru: Султан часто упоминает Всевышнего. Кто он такой?

source: He is the creator of the world, all-powerful and merciful. All that exists was created by Him. He judges supremely, rewards the deserving and punishes the apostates harshly.
ru: Он - создатель мира, всесильный и милосердный. Всё, что существует, создано Им. Он вершит высший суд, награждая достойных и жестоко наказывая отступников.

source: So the Almighty created ugly dwarves and cunning elves? And evil jinns? Why?
ru: Выходит, это Всевышний создал уродливых гномов и подлых эльфов? И злых джиннов? Зачем?

source: O my inquisitive friend, neither dwarves, elves, nor jinns were evil at the moment of creation. Shaitan made them so.
ru: О мой любопытный друг, ни гномы, ни эльфы, ни даже джинны не были злыми в момент творения. Шайтан сделал их такими.

source: Who's shaitan?
ru: Что за шайтан?

source: Shaitan, may his name be thrice cursed, is the main enemy of the Almighty. He perverts his creations and makes them do terrible things.
ru: Шайтан, будь его имя трижды проклято, - главный враг Всевышнего. Он извращает Его творения и направляет их на злые дела.

source: Grump seems to know shaitan. He lives in Durn-Turum. He spits fire and eats trolls alive. Because of him, the Rolling Stones are always looking for a new home.
ru: Похоже, Ворчун уже знает шайтана. Он живёт в Дарн-Туруме. Он плюётся огнём и пожирает троллей заживо. Это из-за него Катящиеся Камни постоянно ищут новый дом.

source: Sha! Then you are fortunate to have come to me, for in my realm the shaitan is fought like nowhere else.
ru: Ша! В таком случае вам повезло найти меня, ибо в моём царстве с шайтаном борются, как нигде ещё.

source: But his jinn were already appearing in the Sultan's realm. What if the shaitan himself comes here? If he finds the trolls?
ru: Но его джинны уже появлялись в царстве Султана. Что, если сам шайтан явится сюда? Если он найдёт троллей?

source: If you accept the true faith, you have nothing to fear. The Almighty not only guides the fallen to heaven but also protects the living from the wiles of shaitan. It is only by His will that I have established a flourishing realm in the middle of a wasteland.
ru: Если вы примете истинную веру, вам нечего страшиться. Всевышний не только направляет павших в рай, но и защищает живых от козней шайтана. Лишь благодаря Нему я смог построить цветущий рай посреди пустоши.

source: Hmmm. Grump thinks it would be good for the trolls to embrace the true faith. But Grump does not want to reject the stones.
ru: Хмм. Ворчун думает, принять истинную веру будет хорошо для троллей. Но Ворчун не хочет отказываться от камней.

source: Sha! There is no contradiction here, since the stones were created by the Almighty. You have already honored his part, now you will honor the whole.
ru: Ша! Здесь нет противоречия, ибо камни также были созданы Всевышним. Раньше вы почитали лишь часть его, теперь же будете почитать целиком.

source: Then the trolls agree.
ru: Тогда тролли согласны.

source: Wonderful! In that case, follow me and I'll take you to my temple.
ru: Чудесно! Раз так, следуйте за мной, я отведу вас в свой храм.

source: Infidels
ru: Неверные

source: Grump saw the truth. Now trolls do not need stones to feel grace. Trolls feel it all the time in their chests. The Almighty will protect the trolls from shaitan. And most importantly, now the fallen trolls will be happy in heaven forever.
ru: Ворчун узрел истину. Теперь троллям не нужны камни, чтобы чувствовать благодать. Теперь тролли чувствуют её всегда, в своей груди. Всевышний защитит троллей от шайтана. И главное, теперь павшие тролли будут счастливы в раю до конца времён.

source: Soon the Sultan called the trolls to a new campaign. Shaitan's minions threaten the Sultan's realm again.
ru: Вскоре Султан позвал троллей в новый поход. Приспешники шайтана вновь вторглись в царство Султана.

source: Wazir
ru: Вазир

source: Scorpius
ru: Скорпиус

source: Invade my land?! Scoundrel, I will burn you and your wretched army alive for this!
ru: Вторгнуться в мои земли?! Негодяй, за это я сожгу заживо и тебя, и твоё жалкое войско!

source: The trolls thought the Sultan ruled over all the desert humans.
ru: Тролли думали, Султан правит всем народом пустыни.

source: Sha! That's right, my friend. But those in whom faith is weakened have fallen under the influence of shaitan. We will bring them back to the right path.
ru: Ша! Так и есть, мой друг. Но те, чья вера слаба, попали под влияние шайтана. Мы лишь возвращаем их на путь истинный.

source: The trolls understand. What is the Sultan's plan?
ru: Тролли понимают. Каков план Султана?

source: The rascal Wazir has hired a band of stinking orcs to hit us in the rear. Hold them off until my cavalry has defeated Wazir. When his citadel falls, we will join forces and together we will crush the orcs in the name of the Almighty!
ru: Подлец Вазир нанял банду вонючих орков, чтобы ударить нам в тыл. Сдерживайте их, покуда моя кавалерия не разобьёт Вазира. Коль скоро его цитадель падёт, совместными усилиями сокрушим орков и одержим победу во имя Всевышнего!

source: The arrogant Abdul thinks he can attack one ruler after another. Take my best poison, orcs. Let your daggers end the era of his treacherous invasions!
ru: Надменный Абдул думает, что может нападать на одного правителя за другим. Возьмите мой лучший яд, орки. Пусть ваши клинки завершат эпоху его вероломных вторжений!

source: Scorpius knows his business. Soon you will win your battle.
ru: Скорпиус своё дело знает. Скоро вы получите свою победу.

source: Defeat the Wazir and Scorpius
ru: Одолейте Вазира и Скорпиуса

source: Death of Sultan Abdul
ru: Смерть Султана Абдула

source: Take up the defenses and hold off the orcs until the Sultan's troops deal with the Wazir. After that, launch a counter-attack.
ru: Займите оборону и сдерживайте оков, пока войска Султана не расправятся с Вазиром. После этого начинайте контратаку.

source: Shaitan! Your lust for power has blinded you, Abdul. Mark my word, within a year you will have your throat slit!
ru: Шайтан! Жажда власти ослепила тебя, Абдул. Попомни мои слова, не пройдёт и года, как ты окажешься с перерезанной глоткой!

source: Sha! You're pathetic, Wazir. Go to hell!
ru: Ша! Ты жилок, Вазир. Отправляйся в ад!

source: Damn it! Abdul's monsters... were... stronger... than ours...
ru: Проклятье! Чудовища Абдула... оказались... сильнее... чем наши...

source: Ha! No one compares to trolls!
ru: Ха! Никто не сравнится с троллями!

source: The cowardly henchmen of the Wazir are fleeing in terror, O Great Sultan! What are you ordering us to do?
ru: Трусливые приспешники Вазира бегут в ужасе, о Великий Султан! Каков будет ваш следующий приказ?

source: Search his castle and turn on the orcs immediately!
ru: Обыщите его замок и немедленно разворачивайтесь на орков!

source: +124 gold!
ru: +124 золота

source: The client is dead, but Scorpius is no ordinary mercenary. Scorpius always finishes the job.
ru: Заказчик погиб, но Скорпиус - не обычный наёмник. Скорпиус всегда выполняет свою работу до конца.

source: Scorpius was hired by the the wrong sultan...
ru: Скорпиус был нанят не тем султаном...

source: The infidels are defeated! Will there be peace in the Sultan's realm now?
ru: Неверные разбиты! Теперь в царстве Султана будет мир?

source: I pray for the day when I will have no envious enemies left, but it has not yet come. But let us return to the palace. There's a special bounty for you at Wazir's castle, and I can't wait to present it.
ru: Я молюсь о дне, когда у меня не останется завистливых врагов, но он ещё не настал. Но вернёмся же во дворец. В замке Вазира я нашёл для вас особую награду, и мне нетерпится её вручить.

source: Maggots think they can beat Scorpius. No way! The clever Scorpius has a surprise for them.
ru: Личинки думают, что могут одолеть Скорпиуса. Как бы не так! Хитрый Скорпиус приготовил для них сюрприз.

source: These crawlers are not gonna be easy for the trolls to deal with. The trolls need Sultan's help.
ru: С этими ползучками троллям будет нелегко справиться. Троллям нужна помощь Султана.

source: A New Family
ru: Новая Семья

source: According to our tradition, every warrior has the right to wives captured in war. Although you didn't know it, I graciously gathered for you a harem of Wazir's beauties. Let them brighten your leisure.
ru: Согласно нашей традиции, каждый воин имеет право на жён, захваченных на войне. Пусть вы не знали об этом, я великодушно вручаю вам гарем из Вазирских красавиц. Пусть они скрасят ваш досуг.

source: Grump does not understand. What are the trolls to do with them, Sultan?
ru: Ворчун не совсем понимает. Что троллям делать с ними, Султан?

source: Trust your instincts and have a good time here! Take a good rest. A new, even more serious campaign against the infidels lies ahead of us.
ru: Доверьтесь инстинкту и хорошо проведите время. Отдохните как следует. Нам предстоит новый, ещё более серьёзный поход против неверных.

source: It seems the Sultan's enemies will never end... But neither will the rewards. Grump is tired. Let's rest!
ru: Похоже, враги Султана никогда не закончатся... Как и его награды. Ворчун устал. Давайте отдыхать!

source: The Oasis of Blood
ru: Оазис Крови

source: The trolls had no idea what to do with the human women until the women gave them a hint.
ru: Тролли не понимали, что делать с человеческими женщинами, пока те сами не подсказали им.

source: Now the trolls have families. Grump hadn't thought about it before, but now he realises that without Sultan, the Rolling Stones wouldn't have enough women to continue their lineage. The kind Sultan has indeed given the trolls everything they need.
ru: Теперь у троллей есть семьи. Раньше Ворчун даже не думал об этом, но теперь он осознал, что без Султана у Катящихся Камней было недостаточно женщин, чтобы продолжить род. Добрый Султан действительно дал троллям всё необходимое.

source: Wazir treated them badly. The trolls are not the same as Wazir. Each troll is kind to his wife.
ru: Вазир обращался с жёнами плохо. Тролли совсем другие. Каждый тролль заботится о своей жене.

source: The trolls spent too little time with their new families. The Sultan urged the trolls to go on a new quest. Grump will fight carefully. Grump wants to get back to his wife soon.
ru: Тролли провели слишком мало времени с новыми семьями. Султан призвал троллей в очередной поход. Теперь Ворчун будет драться осторожно. Ворчун хочет поскорее вернуться к жене.

source: Unfortunately for Grump, the campaign was long. The new infidels lived in a faraway sands. For many days the Sultan's army searched for their camps without success.
ru: К несчастью для Ворчуна, поход выдался долгим. Новые неверные спрятались в далёких-предалеких песках. День за днём войско Султана безуспешно искало их логово.

source: This continued until one hot morning the infidels themselves appeared from the dunes and charged the Sultan's army like an avalanche. A fierce battle broke out. Many humans and trolls were killed. The Sultan was badly wounded. When the fate of our army hung in the balance, Omar managed to gather the survivors and lead them out of the ambush. We reached a mountain oasis and took up defences.
ru: Так продолжалось до тех пор, пока жарким утром неверные сами не показались из-за дюн и не накатились на войско Султана, как лавина. Разразилась жестокая битва. Многие люди и тролли погибли. Султана тяжело ранили. Когда судьба нашего войска повисла на волоске, Омар собрал выживших и вывел их из засады. Мы добрались до скалистого оазиса и заняли оборону.

source: Nomads
ru: Кочевники

source: One of the stinking nomad chiefs has been killed! Well done, trolls. Now our Sultan has a much better chance of survival.
ru: Один вонючий вождь кочевников повержен! Хорошая работа, тролли. Теперь у нашего Султана гораздо больше шансов выжить.

source: Cowardly infidels flee into the sand. Too bad the trolls can't catch up with them.
ru: Трусливые неверные бегут в пустыню. Жаль, троллям их не догнать.

source: You're caught, you damned Abdul! This oasis will be your grave!
ru: Ты в ловушке, проклятый Абдул! Этот оазис станет твоей могилой!

source: And so shall it be to anyone who encroaches upon the lives of free nomads, the Almighty witnesses!
ru: И так будет с каждым, кто посягнёт на жизнь свободных кочевников, Всевышний - свидетель!

source: Surrender, you shaitan scum! Your Sultan will die soon, he has no power now, why die with him?
ru: Сдавайтесь, шайтанское отродье! Ваш Султан скоро сдохнет, у него больше нет власти, так зачем помирать вместе с ним?

source: Never!
ru: Никогда!

source: Healer, is our Sultan really going to die?
ru: Лекарь, неужели наш Султан и впрямь погибнет?
